[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [deva / FrontEnd Servers (EC2)-37746 ](https://app.env0.com/p/c0f2f64b-a98e-4f02-a094-dfa4d8e3edd0/environments/389450d7-855e-498e-b7bc-080b37a995ee):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-070686bd03233cfa1" -> "ami-0bf3fc7dfe888c036" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:244172364962:instance/i-0b46d59e8354a7f04" -> (known after apply)
!       availability_zone                    = "us-west-2b" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-0b46d59e8354a7f04" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       instance_type                        = "t3a.medium" -> "t3a.small"
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-0bd89af263c63c9fc" -> (known after apply)
!       private_dns                          = "ip-10-0-3-33.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.3.33" -> (known after apply)
+       public_dns                           = (known after apply)
!       public_ip                            = "54.191.205.29" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"      = "Oct 22" -> "April 1"
            "Name"      = "acme-frontend"
            "Owner"     = "acme demo org"
            "Terraform" = "true"
            "Test"      = "new tag"
        }
!       tags_all                             = {
!           "Demo"      = "Oct 22" -> "April 1"
            # (4 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-08fdaac30443c7649",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

-       enclave_options {
-           enabled = false -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/sda1" -> null
-           encrypted             = false -> null
-           iops                  = 0 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-051300b7b4477f948" -> null
-           volume_size           = 8 -> null
-           volume_type           = "standard" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-0b46d59e8354a7f04",
+       (known after apply),
    ]
!   private_ip = [
-       "10.0.3.33",
+       (known after apply),
    ]
!   public_ip  = [
-       "54.191.205.29",
+       (known after apply),
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "team_name" but a value
│ was found in file "env0.auto.tfvars.json". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  -$13 ($28 → $15)
Percent: -48%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

! module.acme-ec2.aws_instance.this[0]
  -$13 ($28 → $15)

!     Instance usage (Linux/UNIX, on-demand, t3a.medium → t3a.small)
      -$14 ($27 → $14)

!     root_block_device
    
!         Storage (magnetic) → (general purpose SSD, gp2)
          +$0.40 ($0.40 → $0.80)
    
-         I/O requests
          Monthly cost depends on usage
            -$0.05 per 1M request

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  -$13 ($28 → $15)
Percent: -48%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate decreased by $13 ↓
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃          -$13 ┃           - ┃  -$13 (-48%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/c0f2f64b-a98e-4f02-a094-dfa4d8e3edd0/environments/389450d7-855e-498e-b7bc-080b37a995ee/deployments/644200fb-1377-4db0-ac6c-52fd1d7e4e17)
